{
    "id": "014939",
    "subject": "PHARM",
    "catalogNumber": "601",
    "title": "MSc Thesis Proposal",
    "description": "The objective of Pharm 601 is to encourage graduate students in the MSc in Pharmacy program to best prepare and present their research objectives in written and oral form.  \n\nIn addition to the writing and defence of the Thesis Proposal, each student will be required to:\n\na.  Attend and complete a scientific writing workshop (90 min class time) that will provide background on literature searching, citation and proper management of references as part of preparation of the Thesis Proposal, and participate in a one-on-one appointment with the Pharmacy Liaison Librarian to discuss research strategies and reinforce academic integrity.  The workshop and appointments will be offered each term by the Pharmacy Liaison Librarian.\n\nb.  Attend two Thesis Proposal defences by other students, prior to the students own oral defence.  \n\nThis course is only available for the first Thesis Proposal taken within the Pharmacy program.  If a student is required to fulfill a second Thesis Proposal (for example, if being reassessed for transfer to the PhD) no additional course credit is available. \n\nThe Thesis Proposal component involves the preparation of a written research proposal and oral defence of the proposal.  The intent is to learn how to use the literature to stimulate in-depth thinking about the basis of their thesis research project and to encourage development of their scientific oral presentation skills.  The thesis proposal should outline the reasons for undertaking the project, concisely survey the relevant literature, present a detailed description of the methodology to be used and outline any preliminary results acquired at the time of the proposal.  The written proposal will be considered by an examination committee that will normally comprise the students Advisory Committee plus an independent Chair who will assume that role for all Thesis Proposals within one academic term.  The full Examination Committee will independently grade the written proposal, and separately assign a grade to the oral defence. The simple average of those scores (two per committee member) will be the students grade for the course.",
    "term": [
        "Fall",
        "Winter",
        "Spring"
    ],
    "prereq": [],
    "coreq": [],
    "antireq": [],
    "next": [
        "PHARM 616B"
    ]
}