{
    "id": "008872",
    "subject": "STAT",
    "catalogNumber": "330",
    "title": "Mathematical Statistics",
    "description": "This course provides a mathematically rigorous treatment for topics covered in STAT 230 and 231, and to make essential extensions to the multivariate case. Maximum likelihood estimation. Random variables and distribution theory. Generating functions. Functions of random variables. Limiting distributions. Large sample theory of likelihood methods. Likelihood ratio tests. \r\nJoint probability (density) functions, marginal probability (density) functions, and conditional probability (density) functions of two or more random variables are discussed. Topics covered include independence of random variables, conditional expectation and the determination of the distribution of functions of random variables using the cumulative distribution method, change of variable and moment generating functions.  Properties of the Multinomial and Bivariate Normal distributions are proved. Limiting distributions, including convergence in probability and convergence in distribution, are discussed. Important results, including the Weak Law of Large Numbers, Central Limit Theorem, Slutsky's theorem, and the Delta Method, are introduced with applications. The maximum likelihood method is discussed for the multi-parameter case. Asymptotic properties of the maximum likelihood estimator are examined and used to construct confidence intervals or regions. Tests for simple and composite hypotheses are constructed using the Likelihood Ratio Test. [Offered: F,W,S]",
    "term": [
        "Fall",
        "Winter",
        "Spring"
    ],
    "prereq": [
        "MATH 237",
        "MATH 247",
        "STAT 230",
        "STAT 240",
        "STAT 231",
        "STAT 241"
    ],
    "coreq": [],
    "antireq": [
        "STAT 334"
    ],
    "next": [
        "ACTSC 432",
        "ACTSC 454",
        "STAT 431",
        "STAT 440",
        "STAT 450",
        "STAT 466",
        "ACTSC 445",
        "MATBUS 470",
        "ACTSC 431"
    ]
}