{
    "id": "011075",
    "subject": "DM",
    "catalogNumber": "720",
    "title": "Design: Materials Selection",
    "description": "The purpose of this course is to make sound, intelligent selections of materials for safe and efficient structures or components. A unique feature of the course is that it contains the methodology of design and how materials selection should be simultaneously chosen at every stage of the design process - concurrent engineering. The materials selection should be effected through consideration not only of their properties, their processing, and their fabrication, but also their recyclability, recovery, and disposal after their use, involving the concept of life-cycle analysis.\r\n* Physical, chemical and mechanical properties of materials that are important for the design of the structure of a component. Microstructure insensitive properties such as density, modulus and coefficient of linear expansion which are unaffected by processing.\r\n* Properties such as strength, fracture toughness, fatigue and creep that are affected by processing and the resultant microstructure. How processing influences these properties including corrosion resistance, and the manner in which they change during the fabrication of components.\r\n* Processing of metals and alloys. Solid state equilibrium and non-equilibrium transformations. Melting, solidification and casting of metals, including welding. Plastic deformation including rolling and annealing. Thermal processes such as surface treatments.\r\n* Processing of non-metals. Extrusion, injection molding, thermoforming of thermoplastic polymers. Fabrication of thermosets. Solidification of glasses. Superplastic forming and forming of glasses. Preparation and fabrication of \r\ncomposite materials.\r\n* Design and selection of materials. Performance and selection of ferrous materials for engineering design, considering low alloy steels, tool steels, stainless steels and cast irons.\r\n* Performance and selection of non-ferrous materials for engineering performance considering aluminum, magnesium, copper and nickel alloys.\r\n* Performance and selection of polymers, ceramics and composites for engineering performance.",
    "term": [],
    "prereq": [],
    "coreq": [],
    "antireq": [],
    "next": []
}