{
    "id": "016246",
    "subject": "PHARM",
    "catalogNumber": "616B",
    "title": "PhD Thesis Proposal",
    "description": "The objectives of Pharm 616 are to encourage graduate students in the PhD Pharmacy program to best\nprepare and present their research objectives in written and oral form. In addition to the writing and defence\nof the Thesis proposal, each student will be required to: a) Attend and complete a scientific writing workshop\n(90 min class time) that will provide background on literature searching, citation and proper management of\nreferences as part of preparation of the Thesis Proposal, and participate in a one-on-one appointment with\nthe Pharmacy liaison librarian to discuss research strategies and reinforce academic integrity. The workshop\nand appointments will be offered each term by the Pharmacy liaison librarian. b) Attend two Thesis Proposal\ndefences by other students, prior to the student¿s own oral defence. This course is only available for the first\nThesis Proposal taken within the Pharmacy Program. If a student is required to fulfill a second Thesis Proposal\n(for example, if being assessed for internal transfer from the MSc to PhD program) no additional course credit\nis available. The Thesis Proposal component involves the preparation of a written research proposal and oral\ndefence of the proposal. The intent is to learn how to use the literature to stimulate in-depth thinking about\nthe basis of their thesis research project and to encourage development of their scientific oral presentation\nskills. The thesis proposal should outline the reasons for undertaking the project, concisely survey the relevant\nliterature, present a detailed description of the methodology to be used and outline any preliminary results\nacquired at the time of the proposal. The written proposal will be considered by an examination committee\nthat will normally comprise the student¿s Advisory Committee plus an independent Chair who will assume that\nrole for all thesis proposals within one academic term. The full Examination Committee will independently\ngrade the written proposal, and separately assign a grade to the oral defence. The simple average of those\nscores (two per committee member) will be the student¿s grade for the course.",
    "term": [
        "Fall",
        "Winter",
        "Spring"
    ],
    "prereq": [
        "PHARM 601"
    ],
    "coreq": [],
    "antireq": [],
    "next": []
}